//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным

Console.WriteLine ("Vvedite chislo a");
int a = int.Parse(Console.ReadLine());

if (a % == 0)
{
Console.WriteLine (а + " - chetnoe chislo");
}
else
{
Console.WriteLine (а + " - nechetnoe chislo");
}